In [1]:
import sqlite3
import pandas as pd

In [2]:
# Abrimos la base de datos, que al no existir la crea y creamos nuestro cursor
connection = sqlite3.connect("Modelo_BBDD.db")
cursor_gestion = connection.cursor()

In [3]:
# Creamos la tabla proveedor, con la clave primaria en Codigo_proveedor
query_create = '''
CREATE TABLE Proveedor (
Nombre       TEXT NOT NULL ,
Dirección   TEXT NOT NULL,
Ciudad     TEXT NOT NULL,
Provincia   TEXT NOT NULL,
Código_Proveedor    INT UNIQUE PRIMARY KEY
)
'''
cursor_gestion.execute(query_create)

In [4]:
# Creamos la tabla Articulo, con la clave primaria en Articulo_id y Categoria como clave foranea Categoria

query_create = '''
CREATE TABLE Artículo (
Artículo_id      INT NOT NULL UNIQUE PRIMARY KEY,
Nombre   TEXT NOT NULL,
Color     TEXT NOT NULL,
Precio   FLOAT NOT NULL,
Categoría    TEXT NOT NULL,
FOREIGN KEY (Categoría) REFERENCES Categoría(Nombre) 
)
'''
cursor_gestion.execute(query_create)

In [5]:
# Creamos la tabla Pedido, con la clave primaria en Pedido_id
# Articulo_id con CF  Articulo_id de la tabla Articulo y Codigo_proveedor con CF en Codigo_proveedor en la tabla Proveedor)

query_create= '''
CREATE TABLE Pedido (
Pedido_id   INT NOT NULL UNIQUE PRIMARY KEY,
Fecha   DATE NOT NULL,
Artículo_id  INT NOT NULL, 
Cantidad FLOAT  NOT NULL,
Código_Proveedor    INT NOT NULL, 
FOREIGN KEY (Artículo_id) REFERENCES Artículo(Artículo_id),
FOREIGN KEY (Código_Proveedor) REFERENCES Proveedor(Código_Proveedor)
)
'''
cursor_gestion.execute(query_create)

In [6]:
# Creamos la tabla Categoria, con la clave primaria en Pedido_id
query_create = '''
CREATE TABLE Categoría (
Nombre TEXT NOT NULL UNIQUE,
Categoría_id INT NOT NULL UNIQUE PRIMARY KEY
) 
'''
cursor_gestion.execute(query_create)

In [7]:
# Actualizamos y confirmamos todos los cambios
connection.commit()

In [8]:
# Verificamos si están creadas las tablas y los indices de las claves
query="""
SELECT *
FROM sqlite_master
"""
pd.read_sql(query,connection)

,type,name,tbl_name,rootpage,sql
0,table,Proveedor,Proveedor,2,CREATE TABLE Proveedor (\nNombre TEXT NO...
1,index,sqlite_autoindex_Proveedor_1,Proveedor,3,None
2,table,Artículo,Artículo,4,CREATE TABLE Artículo (\nArtículo_id INT ...
3,index,sqlite_autoindex_Artículo_1,Artículo,5,None
4,table,Pedido,Pedido,6,CREATE TABLE Pedido (\nPedido_id INT NOT NUL...
5,index,sqlite_autoindex_Pedido_1,Pedido,7,None
6,table,Categoría,Categoría,8,CREATE TABLE Categoría (\nNombre TEXT NOT NULL...
7,index,sqlite_autoindex_Categoría_1,Categoría,9,None
8,index,sqlite_autoindex_Categoría_2,Categoría,10,None

In [9]:
# Creamos valores para rellenar las tablas
pd.read_sql("SELECT * FROM Proveedor",connection)

Empty DataFrame
Columns: [Nombre, Dirección, Ciudad, Provincia, Código_Proveedor]
Index: []

In [10]:
cursor_gestion.execute("INSERT INTO Proveedor (Nombre, Dirección, Ciudad, Provincia, Código_Proveedor) VALUES "
               "('ElectroSuministros', 'Calle Principal 123', 'Salamanca', 'Salamanca', '12345'), "
               "('TechExpress', 'Avenida Central 456', 'Madrid', 'Madrid', '28079'), "
               "('GadgetWorld', 'Plaza Mayor 789', 'Vigo', 'Pontevedra', '11111'), "
               "('FutureTech', 'Calle Tranviarios 456', 'Cornella', 'Cataluña', '22222'), "
               "('MegaElectronics', 'Paseo Peatonal 789', 'Alcorcón', 'Madrid', '28007');")

In [11]:
cursor_gestion.execute("INSERT INTO Artículo (Artículo_id, Nombre, Color, Precio, Categoría) VALUES "
               "('1', 'Lavadora Ultra', 'Blanco', '399.99', 'Electrodomésticos'), "
               "('2', 'Smart TV 4K', 'Negro', '799.99', 'Electrónica'), "
               "('3', 'Lámpara Deluxe', 'Plateado', '89.99', 'Hogar'), "
               "('4', 'Tablet Pro', 'Gris', '299.99', 'Electrónica'), "
               "('5', 'Licuadora PowerBlend', 'Rojo', '49.99', 'Electrodomésticos');")

In [12]:
cursor_gestion.execute("INSERT INTO Pedido (Pedido_id, Fecha, Artículo_id, Cantidad, Código_Proveedor) VALUES "
               "('101', '2023-01-01', '1', '25', '12345'), "
               "('102', '2023-02-01', '2', '31', '28079'), "
               "('103', '2023-03-01', '3', '12', '11111'), "
               "('104', '2023-04-01', '4', '42', '22222'), "
               "('105', '2023-05-01', '5', '7', '28007');")

In [13]:
cursor_gestion.execute("INSERT INTO Categoría (Nombre, Categoría_id) VALUES "
               "('Electrónica', '1000'),"
               "('Electrodomésticos', '2000'),"
               "('Hogar','3000');")

In [14]:
connection.commit()

In [15]:
query="""
SELECT *
FROM Pedido
"""

In [16]:
pd.read_sql(query,connection)

   Pedido_id       Fecha  Artículo_id  Cantidad  Código_Proveedor
0        101  2023-01-01            1      25.0             12345
1        102  2023-02-01            2      31.0             28079
2        103  2023-03-01            3      12.0             11111
3        104  2023-04-01            4      42.0             22222
4        105  2023-05-01            5       7.0             28007

In [17]:
connection.close()